{
  "work_history": [
    {
      "company": "Peraton",
      "title": "AI/ML Engineer",
      "duration": "April 2025 - Present",
      "description": "Engineered and deployed full-stack Generative AI solutions within Azure, leveraging LangChain framework and Azure OpenAI LLMs to power agentic chatbots fully integrated with Microsoft Teams and Power Platform. Architected robust data pipelines syncing SharePoint documents to Azure vector databases for RAG systems.",
      "achievements": [
        "Deployed full-stack Generative AI solution with LangChain and Azure OpenAI integrated with Microsoft Teams",
        "Architected data pipeline syncing SharePoint to Azure vector database for RAG system",
        "Enhanced RAG transparency by embedding direct SharePoint source links in LLM responses",
        "Developed intelligent applications using Power Platform to enhance Army program operational efficiency"
      ],
      "skills": [
        "Generative AI",
        "Azure OpenAI",
        "LangChain",
        "RAG",
        "Microsoft Teams",
        "Power Platform",
        "Power Apps",
        "Power Automate",
        "Azure",
        "SharePoint",
        "Vector Databases"
      ]
    },
    {
      "company": "RealmOne",
      "title": "Sr. Data Scientist",
      "duration": "December 2023 - March 2025",
      "description": "Led and built the data science team from inception, shaping critical processes and workflows while mentoring staff. Enhanced data engineering capabilities and informed strategic decision-making on multi-billion dollar programs through complex data analysis and technical reporting to senior leadership.",
      "achievements": [
        "Built data science team from inception and mentored staff in advanced analytics",
        "Developed custom Python API wrappers for seamless data integration from Elasticsearch/Kibana and DoD platforms",
        "Informed strategic decision-making on multi-billion dollar programs through actionable data analysis",
        "Communicated data-driven insights to diverse stakeholders using ML and visualization tools"
      ],
      "skills": [
        "Data Science",
        "Python",
        "TensorFlow",
        "scikit-learn",
        "Matplotlib",
        "Plotly",
        "Elasticsearch",
        "Kibana",
        "API Development",
        "Team Leadership",
        "Machine Learning"
      ]
    },
    {
      "company": "Peraton",
      "title": "Sr. Data Engineer",
      "duration": "November 2021 - December 2023",
      "description": "Led technical projects as Technical Team Lead for Platform Support Team, engineering comprehensive data ingest and visualization pipelines. Created single database of Army's connected devices enabling Cyber leadership to visualize digital terrain.",
      "achievements": [
        "Led technical projects and trained non-technical team members in Python and data skills",
        "Engineered data ingest and visualization pipelines using Python, Elasticsearch, and Kibana",
        "Created unified database of Army's connected devices for Cyber leadership visualization",
        "Developed advanced utilities including parsers, web scraping tools, and analytics with dynamic UIs"
      ],
      "skills": [
        "Data Engineering",
        "Python",
        "Elasticsearch",
        "Kibana",
        "Web Scraping",
        "Data Visualization",
        "Team Leadership",
        "Technical Training"
      ]
    },
    {
      "company": "Sentar, Inc",
      "title": "Discovery Analyst",
      "duration": "July 2016 - November 2021",
      "description": "Led development and deployment of high-impact data science analytic projects across diverse domains including adtech data, network analysis, and geospatial intelligence for federal clients. Engineered full-stack data science solutions delivering massive operational efficiencies.",
      "achievements": [
        "Delivered analytic that saved over 6,600 analyst hours within six months",
        "Increased data processing volume by 875% through engineered solutions",
        "Developed end-to-end data pipelines automating web scraping, API integration, and report generation",
        "Designed custom tools for data querying and enrichment, providing training to technical and non-technical users"
      ],
      "skills": [
        "Data Science",
        "Python",
        "Pandas",
        "Plotly",
        "Matplotlib",
        "Elasticsearch",
        "BeautifulSoup",
        "Selenium",
        "Web Scraping",
        "API Integration",
        "Network Analysis",
        "Geospatial Intelligence"
      ]
    }
  ]
}